app/controllers/cuisines_controller.rb

  def show
    @cuisine = Cuisine.find(params[:id])
---
SELECT  "cuisines".* FROM "cuisines" WHERE "cuisines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @cuisine = Cuisine.new(params.require(:cuisine).permit(:name))

    if @cuisine.save
---
INSERT INTO "cuisines" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Italiana"], ["created_at", "2019-02-03 00:19:16.058041"], ["updated_at", "2019-02-03 00:19:16.058041"]]