app/controllers/recipes_controller.rb

  def new
    @recipe = Recipe.new
    @recipe_types = RecipeType.all
    @cuisines = Cuisine.all
---
SELECT "recipe_types".* FROM "recipe_types"
SELECT "cuisines".* FROM "cuisines"

  def create
    @recipe = Recipe.new(recipe_params)
    if @recipe.save
      redirect_to @recipe
    else
      flash[:alert] = 'Você deve informar todos os dados da receita'
      @recipe_types = RecipeType.all
      @cuisines = Cuisine.all
---
INSERT INTO "recipes" ("title", "difficulty", "cook_time", "created_at", "updated_at", "ingredients", "cook_method", "recipe_type_id", "cuisine_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "recipe_types".* FROM "recipe_types"
SELECT "cuisines".* FROM "cuisines"

  def edit
    @recipe = Recipe.find(params[:id])
    @recipe_types = RecipeType.all
    @cuisines = Cuisine.all
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recipe_types".* FROM "recipe_types"
SELECT "cuisines".* FROM "cuisines"

  def update
    @recipe = Recipe.find(params[:id])

    if @recipe.update(recipe_params)
      redirect_to @recipe
    else
      flash[:alert] = 'Você deve informar todos os dados da receita'
      @recipe_types = RecipeType.all
      @cuisines = Cuisine.all
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "title" = ?, "recipe_type_id" = ?, "cuisine_id" = ?, "cook_time" = ?, "ingredients" = ?, "cook_method" = ?, "updated_at" = ? WHERE "recipes"."id" = ?
SELECT "recipe_types".* FROM "recipe_types"
SELECT "cuisines".* FROM "cuisines"