app/controllers/recipe_types_controller.rb

SELECT  "recipe_types".* FROM "recipe_types" WHERE "recipe_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @recipe_type = RecipeType.find(params[:id])

INSERT INTO "recipe_types" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Massas"], ["created_at", "2019-02-03 00:18:50.863304"], ["updated_at", "2019-02-03 00:18:50.863304"]]
---
  def create
    @recipe_type = RecipeType.new(params.require(:recipe_type).permit(:name))

    if @recipe_type.save